load-test-results/2025-06-08_test_2/20250608_173102_baseline_fast_heavy.txt
Running 1m test @ http://localhost:8080/fast
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.63ms   15.28ms  59.41ms   81.71%
    Req/Sec     3.66k   246.53     7.70k    75.33%
  1747939 requests in 1.00m, 358.39MB read
Requests/sec:  29125.57
Transfer/sec:      5.97MB