load-test-results/2025-06-08_test_2/20250608_173102_baseline_fast_light.txt
Running 30s test @ http://localhost:8080/fast
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.51ms   14.47ms  55.92ms   81.89%
    Req/Sec    15.28k     1.13k   22.07k    77.33%
  912145 requests in 30.00s, 187.02MB read
Requests/sec:  30401.35
Transfer/sec:      6.23MB