load-test-results/2025-06-08_test_2/20250608_173102_gateway_fast_heavy.txt
Running 1m test @ http://localhost:3000/fast
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   103.72ms  193.14ms   1.99s    93.36%
    Req/Sec   198.40     52.12   303.00     80.60%
  92911 requests in 1.00m, 11.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
  Non-2xx or 3xx responses: 92851
Requests/sec:   1548.07
Transfer/sec:    189.03KB