load-test-results/2025-06-08_test_2/20250608_173102_gateway_fast_light.txt
Running 30s test @ http://localhost:3000/fast
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.48ms  253.14ms   1.83s    87.20%
    Req/Sec   764.79    470.81     1.66k    60.15%
  42102 requests in 30.01s, 5.02MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
  Non-2xx or 3xx responses: 42042
Requests/sec:   1403.00
Transfer/sec:    171.38KB