load-test-results/2025-06-08_test_2/20250608_173102_gateway_fast_medium.txt
Running 1m test @ http://localhost:3000/fast
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.43ms  212.89ms   1.98s    91.69%
    Req/Sec   414.94    106.79   600.00     82.22%
  98109 requests in 1.00m, 11.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 33
  Non-2xx or 3xx responses: 98049
Requests/sec:   1634.80
Transfer/sec:    199.62KB