load-test-results/2025-06-08_test_2/20250608_173102_gateway_mixed_load.txt
Running 1m test @ http://localhost:3000
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.95ms  199.62ms   1.97s    91.55%
    Req/Sec   377.97    129.47   616.00     83.67%
  85116 requests in 1.00m, 9.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 71
  Non-2xx or 3xx responses: 84996
Requests/sec:   1418.10
Transfer/sec:    165.49KB